Netology/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/InformationRegisters/ЦеныПоставщиков/ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Netology/src/Documents/УстановкаЦен/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Справочники.Сотрудники.НайтиПоКоду(ПараметрыСеанса.СотрудникТекущегоПользователя.Код);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Требуется согласовать документ");
	КонецЕсли;
	
	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаЦены Из Цены Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекСтрокаЦены.Номенклатура);
		ЦенаСтрока = Цены.НайтиСтроки(Отбор); 
		
		Если ЦенаСтрока.Количество() > 1 Тогда	
			СтрокаСообщения = "Обнаружены дубли номенклатуры. Проведение документа невозможно!";
			Отказ = Истина;
			Сообщить(СтрокаСообщения)   
			
		КонецЕсли;
		
			Движение = Движения.ЦеныПоставщиков.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.Цена = ТекСтрокаЦены.Цена;
			Движение.Ответственный = Ответственный;
		    
	КонецЦикла;    

КонецПроцедуры
